; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	spectrograph1 - mode
	infrared2 - mode
	image0 - mode
	Star3 - direction
	GroundStation4 - direction
	Star1 - direction
	Star0 - direction
	Star2 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star1)
	(supports instrument1 image0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 infrared2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet16)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
	(supports instrument5 image0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
)
(:goal (and
	(pointing satellite2 Star3)
	(pointing satellite3 Phenomenon10)
	(pointing satellite4 Planet16)
	(have_image Phenomenon5 spectrograph1)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon7 infrared2)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 infrared2)
	(have_image Planet11 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 spectrograph1)
	(have_image Planet16 image0)
	(have_image Planet17 image0)
))

)

; plan
1. (switch_on instrument5 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument5)
   goals met: 1 of 14
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 1 of 14
3. (turn_to satellite4 planet16 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet16)
   goals met: 2 of 14
4. (turn_to satellite4 star2 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 star2)
   goals met: 1 of 14
5. (calibrate satellite4 instrument5 star2)
   added: (calibrated instrument5)
   goals met: 1 of 14
6. (turn_to satellite4 phenomenon14 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon14)
   goals met: 1 of 14
7. (take_image satellite4 phenomenon14 instrument5 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 14
8. (turn_to satellite4 phenomenon6 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 14
9. (take_image satellite4 phenomenon6 instrument5 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 3 of 14
10. (turn_to satellite4 phenomenon7 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon7)
   goals met: 3 of 14
11. (take_image satellite4 phenomenon7 instrument5 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 4 of 14
12. (turn_to satellite4 phenomenon9 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon9)
   goals met: 4 of 14
13. (take_image satellite4 phenomenon9 instrument5 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 5 of 14
14. (turn_to satellite4 planet16 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet16)
   goals met: 6 of 14
15. (take_image satellite4 planet16 instrument5 image0)
   added: (have_image planet16 image0)
   goals met: 7 of 14
16. (turn_to satellite3 star0 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star0)
   goals met: 7 of 14
17. (calibrate satellite3 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 7 of 14
18. (turn_to satellite3 phenomenon10 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 phenomenon10)
   goals met: 8 of 14
19. (turn_to satellite4 planet17 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet17)
   goals met: 7 of 14
20. (take_image satellite4 planet17 instrument5 image0)
   added: (have_image planet17 image0)
   goals met: 8 of 14
21. (turn_to satellite4 planet16 planet17)
   deleted: (pointing satellite4 planet17)
   added: (pointing satellite4 planet16)
   goals met: 9 of 14
22. (turn_to satellite4 planet8 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet8)
   goals met: 8 of 14
23. (take_image satellite4 planet8 instrument5 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 9 of 14
24. (turn_to satellite4 planet16 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet16)
   goals met: 10 of 14
25. (turn_to satellite3 phenomenon15 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon15)
   goals met: 9 of 14
26. (take_image satellite3 phenomenon15 instrument4 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 10 of 14
27. (turn_to satellite3 phenomenon10 phenomenon15)
   deleted: (pointing satellite3 phenomenon15)
   added: (pointing satellite3 phenomenon10)
   goals met: 11 of 14
28. (turn_to satellite3 phenomenon5 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 phenomenon5)
   goals met: 10 of 14
29. (take_image satellite3 phenomenon5 instrument4 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 11 of 14
30. (turn_to satellite3 phenomenon10 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon10)
   goals met: 12 of 14
31. (turn_to satellite3 planet11 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet11)
   goals met: 11 of 14
32. (take_image satellite3 planet11 instrument4 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 12 of 14
33. (turn_to satellite3 phenomenon10 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 phenomenon10)
   goals met: 13 of 14
34. (turn_to satellite3 star13 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star13)
   goals met: 12 of 14
35. (take_image satellite3 star13 instrument4 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 13 of 14
36. (turn_to satellite3 phenomenon10 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 phenomenon10)
   goals met: 14 of 14
